import { Company } from '../types/career'

const COMPANIES: Company[] = [
	{
		title: 'Фриланс',
		dateUp: 1583002800,
		dateDown: 1614452400,
		jobTitle: 'Фронтенд-разработчик',
		description: `Разработка сайтов с нуля до конечной цели, доработка  действующих сайтов,
			поддержка сайтов. Перенос сайтов на CMS Wordpress. Для сайтов, которые я
			разрабатывал с нуля, также разработка дизайна.`,
	},
	{
		title: 'UNIT6',
		link: 'https://www.unit6.dev/',
		dateUp: 1614452400,
		dateDown: 1629745200,
		jobTitle: 'Младший фронтенд-разработчик',
		description: `Разработка адаптивных интерфейсов, различные доработки на уже
			существующих сайтах, исправление багов.`,
	},
	{
		title: 'Сайтсофт',
		link: 'https://sitesoft.ru/',
		dateUp: 1629745200,
		dateDown: 1646074800,
		jobTitle: 'Верстальщик',
		description: `Разработка адаптивных интерфейсов с нуля, различные доработки на уже
			существующих сайтах, исправление багов.`,
	},
	{
		title: 'Сайтсофт',
		link: 'https://sitesoft.ru/',
		dateUp: 1646074800,
		dateDown: 1661972400,
		jobTitle: 'Младший фронтенд-разработчик',
		description: `Разработка уникальных компонентов для конструктора сайтов
		SiteSofte Platform, выступал в роли Team Lead разработчика на проекте с
		версткой проекта, проведение ревью, обучение новых сотрудников, разработка
		библиотеки на TS`,
	},
	{
		title: 'Сайтсофт',
		link: 'https://sitesoft.ru/',
		dateUp: 1661972400,
		dateDown: 1672426800,
		jobTitle: 'Фронтенд-разработчик',
		description: `Разработка уникальных компонентов для конструктора сайтов
		SiteSofte Platform, создание веб интерфейса для чата с чат-ботом и видеочата,
		создание шаблонной сборки будущих проектов на Nuxt 2 + Vue 2 + TS`,
	},
	{
		title: 'ПрессИндекс',
		link: 'https://pressindex.ru/',
		dateUp: 1672513200,
		isNowJob: true,
		jobTitle: 'Фронтенд-разработчик',
		description: `Разработка и доработки системы мониторинга.
		Перевод интерфейса на другие языки. React + TS + Redux Toolkit`,
	},
]

export { COMPANIES }
